       identification division.
       program-id. helloworld.
       author. youssouf.

       procedure division.
             
           display "hello world youssouf".
           
           PERFORM 5 TIMES 
             
           stop run. 