       IDENTIFICATION DIVISION.      
       PROGRAM-ID 'BIENVENU'.        
       AUTHOR. YOUSSOUF.             
      *THIS IS A COMMENT IN COBOL    
       ENVIRONMENT DIVISION.         
       DATA DIVISION.                 
       PROCEDURE DIVISION.           
         0100-START-HERE.             
           STOP RUN.                
           END PROGRAM OBTAININPUT.  
/*                                   
//                                   