       identification division.
       program-id. VARIABLE.
       author. youssouf.

       procedure division.
       
           display "hello world".

           stop run. 