       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX01.
       author. YOUSSOUF.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NOM PIC X(4).

       PROCEDURE DIVISION.

           DISPLAY 'BIENVENUE CHER COBOLISTE'.
           DISPLAY 'QUEL EST TON NOM?'.
              
           ACCEPT WS-NOM.

           DISPLAY 'ET BIEN SALUT A TOI ' WS-NOM .

           STOP RUN.
