       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S9(3)V9(2).
       01 NUM2 PIC PPP999.
       01 NUM3 PIC S9(3)V9(2) VALUE -123.45.
       01 NAME PIC A(6) VALUE "ABCDEF".
       01 ID-t PIC X(5) VALUE "A121$".

       01 MONTANT PIC  -$$$$.99 VALUE  -3.56  .
       PROCEDURE DIVISION.

           DISPLAY "BIENVENUE A CETTE FORMATION".
           
              DISPLAY MONTANT  .
           STOP RUN.