       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PERSONNE.
           10 NOM PIC X(20) VALUE "AAAAAAAAAA".
           10 PRENOM PIC X(20) VALUE "BBBBBBBBBB".
           10 ADRESSE PIC A(25) VALUE "CCCCCCCCCC".
           10 AGE PIC X(2) VALUE  "35".
           66 PERSONNE-1 RENAMES NOM THRU ADRESSE.
       PROCEDURE DIVISION.
           DISPLAY "BIENVENUE A CETTE FORMATION".
           
           DISPLAY  AGE . 

           DISPLAY PERSONNE-1.

           DISPLAY  PERSONNE . 

           STOP RUN.