       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.
       PROCEDURE DIVISION.
           DISPLAY "BIENVENUE A CETTE FORMATION".
           STOP RUN.