       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-TEST.
           05 VAR1 OCCURS 3 TIMES INDEXED BY I.
               10 VAR2 PIC A(2).
               10 VAR3 OCCURS 2 TIMES INDEXED BY J.
                  15 VAR4 PIC X(3).
       PROCEDURE DIVISION.
            MOVE '12ABCDEF34GHIJKL56MNOPQR' TO TABLE-TEST.
            PERFORM A-PARA VARYING I FROM 1 BY 1 UNTIL I >3
            STOP RUN.
       A-PARA.
            PERFORM C-PARA VARYING J FROM 1 BY 1 UNTIL J>2.
       C-PARA.
           DISPLAY VAR3(I,J).