       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBMMF.
       WORKING-STORAGE SECTION.
       01 WS-COMMAREA    PIC X(70).
       PROCEDURE DIVISION.

       EXEC CICS LINK
       PROGRAM('PROGRAM')
       COMMAREA(WS-COMMAREA)
       LENGTH(70)
       END-EXEC.