       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S9(9) VALUE -1234.
       01 NUM2 PIC S9(9) VALUE 123456.
       PROCEDURE DIVISION.
       DEBUT.
           IF NUM1 IS POSITIVE THEN
           DISPLAY "NUM1 IS POSITIVE".
           IF NUM1 IS NEGATIVE THEN
           DISPLAY "NUM1 IS NEGATIVE".
           IF NUM1 IS ZERO THEN
           DISPLAY "NUM1 IS ZERO".
           IF NUM2 IS POSITIVE THEN
           DISPLAY "NUM2 IS POSITIVE".
           STOP RUN.