       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NOTE-EXAM PIC 9(3) .
       01 NOTE-STAGE PIC 9(3) .
       01 DECISION PIC X(50) .
       01 VAR1 PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           MOVE  9 TO  NOTE-EXAM .
           MOVE  11 TO  NOTE-STAGE .
           EVALUATE NOTE-EXAM ALSO NOTE-STAGE
           WHEN 10 THRU 20 ALSO 10 THRU 20
           MOVE "RECU" TO DECISION
           WHEN 8 THRU 10 ALSO 10 THRU 12
           MOVE "RATTRAPE PAR LE STAGE" TO DECISION
           WHEN 14 THRU 20 ALSO 9 THRU 10
           MOVE "RATTRAPE PAR NOTES EXAM" TO DECISION
           WHEN OTHER
           MOVE "ELIMINE" TO DECISION
          
           END-EVALUATE .
            DISPLAY NOTE-EXAM  "  stag " NOTE-STAGE .
            DISPLAY DECISION .

            STOP  RUN .