       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 VAR1 PIC 9(3) VALUE 500.
       01 VAR2 PIC 9(3) VALUE 600.
       01 VAR22 PIC 9(3).

       01 VAR3 PIC 9(3) VALUE 700.

       01 QUANTITE PIC 9(5).
       01 PRIX-UNITAIRE  PIC 9(5).
       01 PRIX PIC 9(5).
       01 SOMME-JOURNEE PIC 9(5).
       01 NOMBRE-PARTS PIC 9(5).
       01 SOMME-PART PIC 9(5).

       01 NB-LIVRE PIC 9(5).
       01 NB-ELEVE PIC 9(5).
       01 PART-ELEVE PIC 9(5).
       01 RESTE PIC 9(5).

       01 POURCENT-REMISE PIC 9(5).

       01 POIDS-GATEAU PIC 9(5).
       01 POIDS-PART PIC 9(5).

        01 CODE-ERREUR PIC 9(5).


       PROCEDURE DIVISION. 

              MULTIPLY QUANTITE BY  PRIX-UNITAIRE GIVING PRIX.

              DIVIDE SOMME-JOURNEE BY NOMBRE-PARTS GIVING SOMME-PART.

           DIVIDE NB-LIVRE BY NB-ELEVE GIVING PART-ELEVE REMAINDER 
                                   RESTE .
           
           COMPUTE PRIX = (PRIX-UNITAIRE * QUANTITE) * 
                (1 - POURCENT-REMISE / 100)

            DISPLAY " exemple 2 ".
           DIVIDE POIDS-GATEAU BY NOMBRE-PARTS GIVING POIDS-PART ROUNDED.   

           COMPUTE PRIX = (PRIX-UNITAIRE * QUANTITE) * 
             (1 - POURCENT-REMISE / 100) ON SIZE ERROR
              DISPLAY "DEBORDEMENT"
           DISPLAY "DONNEES PROBABLEMENT INCORRECTES"
           MOVE 17 TO CODE-ERREUR
           NOT ON SIZE ERROR
           MOVE 0 TO CODE-ERREUR
.
              END-COMPUTE.


           DISPLAY CODE-ERREUR .
           DISPLAY PRIX 


           STOP  RUN .