       IDENTIFICATION DIVISION.
       PROGRAM-ID. "HELLOWORLD".
       AUTHOR.     PEGGY FISHER.
      *This is a comment in COBOL
      *Columns 8-11 A Margin
      *Columns 12-72 B Margin
       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION. 
        0100-START-HERE.
           DISPLAY "Hello World! codeweare".
           STOP RUN.
       END PROGRAM HELLOWORLD.