       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORMTHRU.
       PROCEDURE DIVISION.
       A-PARA.
           PERFORM DISPLAY 'IN A-PARA'
           END-PERFORM.
           PERFORM C-PARA THRU E-PARA.
       B-PARA.
           DISPLAY 'IN B-PARA'.
           STOP RUN.
       C-PARA.
           DISPLAY 'IN C-PARA'.
       D-PARA.
           DISPLAY 'IN D-PARA'.
       E-PARA.
•          DISPLAY 'IN E-PARA'.