       identification division.
       program-id. helloworld.
       author. youssouf.
       DATA DIVISION.
       WORKING-STORAGE SECTION.


       01 END-OF-FILE PIC X .
           88 EOF VALUE 'N'.
       procedure division.
       
           display "hello world".

           
              
           


              
           
           stop run. 