       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBWRITE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE ASSIGN TO EMP-FILE
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE.
       01 EMPLOYEEFILE.
           05 EMPLOYEEID PIC X(5).
           05 NAME PIC A(10).

       PROCEDURE DIVISION.

           OPEN EXTEND EMPLOYEE.
           MOVE '100' TO EMPLOYEEID.
           MOVE 'REVATHY' TO NAME.
           WRITE EMPLOYEEFILE
           END-WRITE.
           CLOSE EMPLOYEE.
           STOP RUN.